/**
 * Created by wangziying on 2017/9/22.
 */
define( [], function () {
	//遥测  客户提出只关注以下质量码 其余都为正常
	// 越合理范围  33554432 RGB(0,0,0) 4
	//不变化 -43776 RGB(255,85,0) 32
	//封锁 -11162881 RGB(85,170,255) 256
	//告警抑制 16777216  RGB(0,0,0) 512
	//非实测 -5592449 RGB(170,170,127) 8192
	//被对侧代   -256 RGB(255,255,0) 65536
	//被旁路代  -16733696 RGB(0,170,0) 131072
	//越上限1  -65536 RGB(255,0,0) 4194304
	//越下限1 -65536 RGB(255,0,0)
	//越上限2  -65536 RGB(255,0,0)
	//越下限2 -65536 RGB(255,0,0)
	//越上限3  -65536 RGB(255,0,0)
	//越下限3 -65536 RGB(255,0,0)
	//越上限4  -65536 RGB(255,0,0) 268435456
	//越下限4 -65536 RGB(255,0,0) 536870912
	//正常 -65794 RGB(254,254,254)  1073741824
	
	// fm默认0，flash默认0,lc\fc默认作图色,order优先级
	var ycObj = {
		14 : {
			order : 200
		},
		22 : {
			order : 29
		},
		31 : {
			lc:"RGB(254,254,254)",
			fc:"RGB(254,254,254)",
			order:28
		},
		1 :  {},
		4 :  {},
		3 :  {},
		17 : {},
		19 : {},
		16 : {},
		15 : {},
		10 : {},
		28 : {},
		12 : {},
		11 : {},
		27 : {},
		26 : {},
		25 : {},
		21 : {},
		20 : {},
		6 :  {},
		30 : {},
		29 : {},
		24 : {},
		23 : {},
		9 :  {},
		8 :  {},
		2 :  {},
		18 : {},
		5 :  {},
		13 : {},
		7 :  {}
	};
	
	
	var yc1t = [ "#ffffff", "#FF9900", "#FF6600", "#FF6699",
		"#FF3366", "#FF3300", "#CCFFFF", "#CCFF00",
		"#CCCCFF", "#ffffff", "#ffffff", "#ffffff",
		"#ffffff", "#CC9900", "#CC66FF", "#ffffff",
		"#ffffff", "#99FF66", "#ffffff", "#ffffff",
		"#ffffff", "#9999FF", "#999999", "#999900",
		"#ffffff", "#FFC125", "#ffffff", "#ffffff",
		"#FF83FA", "#ffffff", "#ffffff" ];
	
	var yc1 = [ "#ffffff", "RGB(255,0,0)", "RGB(255,0,0)", "RGB(255,0,0)",
		"RGB(255,0,0)", "RGB(255,0,0)", "RGB(255,0,0)", "RGB(255,0,0)",
		"RGB(255,0,0)", "#ffffff", "#ffffff", "#ffffff",
		"#ffffff", "RGB(0,170,0)", "RGB(255,255,0)", "#ffffff",
		"#ffffff", "RGB(170,170,127)", "#ffffff", "#ffffff",
		"#ffffff", "RGB(255,255,255)", "RGB(85,170,255)", "#ffffff",
		"#ffffff", "RGB(255,85,0)", "#ffffff", "#ffffff",
		"RGB(255,255,255)", "#ffffff", "#ffffff" ];
	var yctext = [ "正常", "越下限4", "越上限4", "越下限3",
		"越上限3", "越下限2", "越上限2", "越下限1",
		"越上限1", "正常", "正常", "正常",
		"正常", "被旁路代", "被对侧代", "正常",
		"正常", "非实测", "正常", "正常",
		"正常", "告警抑制", "封锁", "未初始化",
		"正常", "不变化", "正常", "正常",
		"越合理范围", "正常", "正常" ];
} );